content/zettels/blockchain.md
+++
title = "Blockchain"
author = ["Jethro Kuan"]
lastmod = 2020-03-07T23:43:04+08:00
draft = false
+++

## Stellar {#stellar}

-   Payment-focused crypto-currency.
-   open-source, non-profit organization.


## Consensus Protocols {#consensus-protocols}


### Proof of Work (POW) {#proof-of-work--pow}

-   1 CPU 1 vote.
-   susceptible to 51% attack


### Proof of S(?) {#proof-of-s}

-   1 token 1 vote
-   Rich dominate the network


### Delegated Proof of S {#delegated-proof-of-s}

-   Like POS, but can borrow, in exchange for incentives


### RCP {#rcp}

-   Ripple protocol
-   Permissions-based
-   Uses Byzantine Fault Tolerance (BFT)

-   <span class="org-todo todo TODO">TODO</span>  See 2 General Problem


### Stellar {#stellar}

-   Fork of Ripple
-   PBFT
    -   Tiered permissions
